onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.ДЗ_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДЗ_СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/ДЗ_ДополнитьФормуСервер/Module.bsl
Процедура ДополнитьФорму(Форма) Экспорт   
	  
	  ИмяФормы = Форма.ИмяФормы;
	  
	  Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда  
		  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);   
		  ДобавитьПолеСогласованнаяСкидкаШапкаЛево(Форма);  
		  ДобавитьКомандуПересчитатьТаблицуПравоОтСогласованнаяСкидка(Форма); 
	  //ИначеЕсли  ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда  	  
		  //ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);   
	  //ИначеЕсли  ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда  	  
		  //ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма);  
	  //ИначеЕсли  ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда 
		  //ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма);  
	  //ИначеЕсли  ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда  	  
		  //ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма); 		  
	  КонецЕсли;    
	  
  КонецПроцедуры  
  
  
  Процедура  ДобавитьПолеКонтактноеЛицоШапкаПраво(Форма) 
	  
	  ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры 
  
  Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.СуммаДокумента);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры   
  
    Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередОснование(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,Форма.Элементы.Основание);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	  
  КонецПроцедуры 
  
  Процедура  ДобавитьПолеСогласованнаяСкидкаШапкаЛево(Форма)
	  
	  ПолеВвода = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	  ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка"; 
	  ПолеВвода.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	  
  КонецПроцедуры  
  
  Процедура  ДобавитьКомандуПересчитатьТаблицуПравоОтСогласованнаяСкидка(Форма)
	  
	  Команда = Форма.Команды.Добавить("ПересчитатьТаблицу");
	  Команда.Заголовок = "ПересчитатьТаблицу";
	  Команда.Действие = "КомандаПересчитатьТаблицу";
	  КомандаФормы = Форма.Элементы.Вставить("КнопкаПересчитатьТаблицу", Тип("КнопкаФормы"), Форма.Элементы.ГруппаШапкаЛево);
	  КомандаФормы.ИмяКоманды ="ПересчитатьТаблицу"; 
	  КомандаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	  
  КонецПроцедуры
